## Connect to Snowflake

In [7]:
import snowflake.connector
from snowflake_credentials import snowflake_params

conn = snowflake.connector.connect(
    user=snowflake_params['user'],
    password=snowflake_params['password'],
    account=snowflake_params['account'],
    warehouse=snowflake_params['warehouse'],
    database=snowflake_params['database'],
    schema=snowflake_params['schema'],
    role=snowflake_params['role']
)

cur = conn.cursor()

## Preview the Table Data

In [21]:
businesses_count = cur.execute('''
                               SELECT COUNT(*)
                               FROM yelp_businesses
                               ''').fetch_pandas_all()

print(f'There are {businesses_count['COUNT(*)'][0]:,} records in the Yelp businesses table.')

df = cur.execute('''
                 SELECT *
                 FROM yelp_businesses 
                 LIMIT 5
                 ''').fetch_pandas_all()

display(df)

There are 150,346 records in the Yelp businesses table.

,NAME,BUSINESS_ID,IS_OPEN,REVIEW_COUNT,STARS,CATEGORIES,STATE,CITY,POSTAL_CODE,LATITUDE,LONGITUDE
0,"Abby Rappoport, LAC, CMQ",Pns2l4eNsfO8kk83dixA6A,0,7,5,"Doctors, Traditional Chinese Medicine, Naturop...",CA,Santa Barbara,93101,34.426679,-119.711197
1,The UPS Store,mpf3x-BjTdTEA3yCZrAYPw,1,15,3,"Shipping Centers, Local Services, Notaries, Ma...",MO,Affton,63123,38.551126,-90.335695
2,Target,tUFrWirKiKi_TAnsVWINQQ,0,22,4,"Department Stores, Shopping, Fashion, Home & G...",AZ,Tucson,85711,32.223236,-110.880452
3,St Honore Pastries,MTSW4McQd7CbVtyjqoe9mw,1,80,4,"Restaurants, Food, Bubble Tea, Coffee & Tea, B...",PA,Philadelphia,19107,39.955505,-75.155564
4,Perkiomen Valley Brewery,mWMc6_wTdE0EUBKIGXDVfA,1,13,5,"Brewpubs, Breweries, Food",PA,Green Lane,18054,40.338183,-75.471659

In [22]:
reviews_count = cur.execute('''
                               SELECT COUNT(*)
                               FROM yelp_reviews
                               ''').fetch_pandas_all()

print(f'There are {reviews_count['COUNT(*)'][0]:,} records in the Yelp reviews table.')

df = cur.execute('''
                 SELECT *
                 FROM yelp_reviews 
                 LIMIT 5
                 ''').fetch_pandas_all()

display(df)

There are 6,990,280 records in the Yelp reviews table.

,BUSINESS_ID,REVIEW_ID,USER_ID,REVIEW_DATE,USER_REVIEW,STARS,COOL_VOTES,FUNNY_VOTES,USEFUL_VOTES
0,iRIHK8-EwpeffwvoO4nzIA,oXpWjOG2rue-2bHbjvDZIQ,1uHAAjOX18Px4OibCMI3pg,2018-10-04,Awesome spot. This is one of my favorite place...,5,0,0,0
1,U9TJ13_B6mySAb1RI4lhug,QVL6hH7M0nv5ljHCjRfK0w,KZXmUq6y_0k4guwAfPmQcQ,2017-05-13,"I like Rumor, but some nights, Idk why they ch...",3,0,0,0
2,oBNrLz4EDhiscSlbOl8uAw,PAjnd_I5pkN2m9Mg5cJTUg,C8jSfs5zj3NkqBx-YRb3tA,2018-04-15,This place has the rudest server I think I hav...,1,0,0,1
3,IL7MEBxfei9pOaGR1g6joQ,H_gK3gJrBSMlxELs2BC7sQ,YOIorhfo8hHhilRyam2c4w,2017-12-29,I've had the ice cream from here a number of t...,4,0,0,0
4,t-cT3vDv6vB0AAow_XIK8g,kViZwGpixoAnpN7xpsaJyQ,y6RQ8oBEtryoXVTxBddNng,2012-06-26,This is a very nice store to visit. They have ...,5,0,0,0

In [23]:
users_count = cur.execute('''
                               SELECT COUNT(*)
                               FROM yelp_users
                               ''').fetch_pandas_all()

print(f'There are {users_count['COUNT(*)'][0]:,} records in the Yelp users table.')

df = cur.execute('''
                 SELECT *
                 FROM yelp_users 
                 LIMIT 5
                 ''').fetch_pandas_all()

display(df)

There are 1,987,897 records in the Yelp users table.

,FIRST_NAME,USER_ID,YELPING_SINCE,REVIEW_COUNT,AVG_STARS,FANS,COOL_COMPLIMENTS,CUTE_COMPLIMENTS,FUNNY_COMPLIMENTS,HOT_COMPLIMENTS,...,MORE_COMPLIMENTS,NOTE_COMPLIMENTS,PHOTO_COMPLIMENTS,PLAIN_COMPLIMENTS,PROFILE_COMPLIMENTS,WRITER_COMPLIMENTS,COOL_VOTES,ELITE,FUNNY_VOTES,USEFUL_VOTES
0,David,VPQ3ZKv1BY87UWuERLqoYQ,2010-07-05,13,4.31,0,0,0,0,0,...,0,0,0,0,0,0,11,,5,46
1,Pomeloh,Blu3JBisecCoFuwzV3A3eA,2012-03-29,14,4.40,0,0,0,0,0,...,0,0,0,0,0,0,7,,2,12
2,Alana,lDbh9HBWxyEM_ilY5ER_dg,2011-10-31,6,5.00,0,0,0,0,0,...,0,0,0,1,0,0,4,,0,6
3,Nancy,lkTKWP8Y-BN_8ggxrls2rA,2012-01-16,27,4.00,0,0,0,0,0,...,0,1,0,0,0,0,3,,1,17
4,Maureen,o57OsxkvddOIMpj_qiprSw,2011-07-08,3,3.33,0,0,0,0,0,...,0,1,0,0,0,0,0,,0,2

In [24]:
tips_count = cur.execute('''
                               SELECT COUNT(*)
                               FROM yelp_tips
                               ''').fetch_pandas_all()

print(f'There are {tips_count['COUNT(*)'][0]:,} records in the Yelp tips table.')

df = cur.execute('''
                 SELECT *
                 FROM yelp_tips 
                 LIMIT 5
                 ''').fetch_pandas_all()

display(df)

There are 908,915 records in the Yelp tips table.

,BUSINESS_ID,USER_ID,DATE,TIP,COMPLIMENT_COUNT
0,WnHG_obpmHazbngTdu570Q,_Wkf2RNDnBuqMOpzSqmZXw,2015-08-14,Only a couple more weeks,0
1,c-CAcdH2-12g1sQUQfy5xw,xnuEEuMfvCNLFMtaZf7asw,2016-03-20,Get here early!!,0
2,wj8XtPyuREj8_0GQz3LZ6w,W0DJOPsSwcAj0uqCJG8iLw,2015-08-14,If you have not tried this place what are you ...,0
3,l8vwslfqKq1yxlmgVi-M0Q,AED6tP0v4aMPd9-YtjPcPg,2015-05-11,Check out the third floor lounge for nice city...,0
4,KZe5kpIHWVuJl6WgNYzceg,9UZlB3fHVe2JBvPw4kRb5g,2012-03-03,Pancakes with Breakfast Trick?,0

## Category Analysis

#### Number of Businesses by Category

In [ ]:
# Top 20 categories of all businesses on Yelp.
df = cur.execute('''
                 WITH cte AS (
                    -- split the categories column so each business has a row for each category it has
                    SELECT business_id, stars,
                    TRIM(A.value) AS category
                    FROM yelp_businesses,
                    LATERAL SPLIT_TO_TABLE(categories, ',') A
                )

                SELECT category, COUNT(DISTINCT business_id) AS num_of_businesses, ROUND(AVG(stars), 2) AS avg_stars
                FROM cte
                GROUP BY 1
                ORDER BY 2 DESC
                LIMIT 20;
                 ''').fetch_pandas_all()

display(df)

                     CATEGORY  NUM_OF_BUSINESSES AVG_STARS
0                 Restaurants              52268      3.77
1                        Food              27781      3.93
2                    Shopping              24395      3.86
3               Home Services              14356      3.69
4               Beauty & Spas              14292      4.05
5                   Nightlife              12281      3.91
6            Health & Medical              11890      3.86
7              Local Services              11198      3.85
8                        Bars              11065      3.90
9                  Automotive              10773      3.75
10  Event Planning & Services               9895      3.93
11                 Sandwiches               8366      3.80
12     American (Traditional)               8139      3.65
13                Active Life               7687      4.23
14                      Pizza               7093      3.60
15               Coffee & Tea               6703      3.78
16                  Fast Food               6472      2.89
17         Breakfast & Brunch               6239      3.82
18             American (New)               6097      3.84
19            Hotels & Travel               5857      3.50

#### Review Volume by Category

In [ ]:
# Top 20 categories by number of reviews
df = cur.execute('''
                 WITH cte AS (
                    -- split the categories column so each business has a row for each category it has
                    SELECT business_id, stars, review_count,
                    TRIM(A.value) AS category
                    FROM yelp_businesses,
                    LATERAL SPLIT_TO_TABLE(categories, ',') A
                )

                SELECT category, SUM(review_count) AS num_of_reviews, COUNT(DISTINCT business_id) AS num_of_businesses, ROUND(AVG(stars), 2) AS avg_stars
                FROM cte
                GROUP BY 1  
                ORDER BY 2 DESC
                LIMIT 20;
                 ''').fetch_pandas_all()

display(df)

                     CATEGORY  NUM_OF_REVIEWS  NUM_OF_BUSINESSES AVG_STARS
0                 Restaurants         4561279              52268      3.77
1                        Food         1752281              27781      3.93
2                   Nightlife         1488163              12281      3.91
3                        Bars         1406415              11065      3.90
4      American (Traditional)          976483               8139      3.65
5              American (New)          950560               6097      3.84
6          Breakfast & Brunch          839467               6239      3.82
7                  Sandwiches          669139               8366      3.80
8                     Seafood          600183               3539      3.92
9   Event Planning & Services          591442               9895      3.93
10                   Shopping          505372              24395      3.86
11                      Pizza          456944               7093      3.60
12                    Burgers          429866               5636      3.19
13               Coffee & Tea          428230               6703      3.78
14                    Italian          422530               4573      3.76
15                    Mexican          416307               4600      3.78
16              Beauty & Spas          354203              14292      4.05
17       Arts & Entertainment          335139               5434      4.23
18              Cocktail Bars          328110               1718      4.14
19                      Salad          321566               3064      3.91

#### Average Star Rating by Category

In [ ]:
# Top 20 categories by average star rating (minimum 1000 reviews)
df = cur.execute('''
                 WITH cte AS (
                    -- split the categories column so each business has a row for each category it has
                    SELECT business_id, stars, review_count,
                    TRIM(A.value) AS category
                    FROM yelp_businesses,
                    LATERAL SPLIT_TO_TABLE(categories, ',') A
                )

                SELECT category, SUM(review_count) AS num_of_reviews, COUNT(DISTINCT business_id) AS num_of_businesses, ROUND(AVG(stars), 2) AS avg_stars
                FROM cte
                GROUP BY 1  
                HAVING SUM(review_count) >= 1000
                ORDER BY 4 DESC
                LIMIT 20;
                 ''').fetch_pandas_all()

display(df)

               CATEGORY  NUM_OF_REVIEWS  NUM_OF_BUSINESSES AVG_STARS
0   Conveyor Belt Sushi            1128                  1      5.00
1             Art Tours            1962                 18      4.94
2            Bike tours            1714                 32      4.88
3              Sugaring            1549                 39      4.85
4              Cideries            1650                 25      4.84
5            Beer Tours            2949                 51      4.82
6                 Reiki            3048                201      4.82
7         Barre Classes            2926                158      4.80
8          Axe Throwing            1856                 53      4.79
9    Meditation Centers            1451                 99      4.79
10  Photo Booth Rentals            1618                 92      4.79
11          Paint & Sip            2822                109      4.78
12            Float Spa            1204                 50      4.76
13         Distilleries            9363                105      4.75
14     Historical Tours           15355                136      4.74
15           Life Coach            1831                130      4.73
16    Botanical Gardens            7996                 60      4.72
17       Personal Chefs            4552                116      4.72
18   Party Bike Rentals            1070                 18      4.72
19               Hiking            6301                211      4.72

In [16]:
# Bottom 20 categories by average star rating (minimum 1000 reviews)
df = cur.execute('''
                 WITH cte AS (
                    -- split the categories column so each business has a row for each category it has
                    SELECT business_id, stars, review_count,
                    TRIM(A.value) AS category
                    FROM yelp_businesses,
                    LATERAL SPLIT_TO_TABLE(categories, ',') A
                )

                SELECT category, SUM(review_count) AS num_of_reviews, COUNT(DISTINCT business_id) AS num_of_businesses, ROUND(AVG(stars), 2) AS avg_stars
                FROM cte
                GROUP BY 1  
                HAVING SUM(review_count) >= 1000
                ORDER BY 4
                LIMIT 20;
                 ''').fetch_pandas_all()

display(df)

                        CATEGORY  NUM_OF_REVIEWS  NUM_OF_BUSINESSES AVG_STARS
0   Television Service Providers            4253                159      2.33
1             University Housing            2630                122      2.53
2     Internet Service Providers            7947                356      2.60
3            Property Management           12282                759      2.74
4                   Post Offices            5284                327      2.79
5                     Apartments           28510               1921      2.82
6                   Truck Rental            3633                206      2.84
7                      Fast Food          224529               6472      2.89
8                       Airlines            6018                118      2.89
9                      Utilities            2276                102      2.90
10         Banks & Credit Unions            7577                749      2.90
11                       Parking            9327                243      2.90
12            Telecommunications            5735                397      2.95
13                      Pharmacy            8109                503      2.96
14                       Propane            2428                147      2.99
15                    Car Rental           24378                670      3.02
16                    Drugstores           30531               1630      3.02
17               Emergency Rooms            2654                 93      3.06
18                 Mobile Phones           20714                952      3.09
19                     Hospitals           10762                395      3.10

In [ ]:
# Categories with high stars and low engagement
df = cur.execute('''
                 WITH cte AS (
                    -- split the categories column so each business has a row for each category it has
                    SELECT business_id, stars, review_count,
                    TRIM(A.value) AS category
                    FROM yelp_businesses,
                    LATERAL SPLIT_TO_TABLE(categories, ',') A
                )

                SELECT category, SUM(review_count) AS num_of_reviews, COUNT(DISTINCT business_id) AS num_of_businesses, ROUND(AVG(stars), 2) AS avg_stars
                FROM cte
                GROUP BY 1  
                ORDER BY 4 DESC, 2
                LIMIT 20;
                 ''').fetch_pandas_all()

display(df)

                        CATEGORY  NUM_OF_REVIEWS  NUM_OF_BUSINESSES  AVG_STARS
0        Metal Detector Services               6                  1       5.00
1                     Patent Law               6                  1       5.00
2                 Karaoke Rental               7                  1       5.00
3                 Circus Schools               9                  1       5.00
4                  Bubble Soccer              13                  1       5.00
5                         Mohels              14                  1       5.00
6                Art Consultants              15                  2       5.00
7                    Calligraphy              16                  2       5.00
8                Water Suppliers              17                  1       5.00
9                   Silent Disco              37                  2       5.00
10                 Childproofing              39                  3       5.00
11        Cheese Tasting Classes              51                  2       5.00
12                   Experiences              56                  2       5.00
13          Sport Equipment Hire              65                  1       5.00
14                        Somali             135                  2       5.00
15       Real Estate Photography             339                 32       4.91
16  Undersea/Hyperbaric Medicine              65                  5       4.90
17                Gerontologists              32                  4       4.88
18                     Art Tours            1962                 18       4.86
19           Boudoir Photography             392                 37       4.84

## Reviews Analysis

#### Total Review Volume by Star Rating

In [45]:
# Count of reviews for each star value 1-5
df = cur.execute('''
                 SELECT '1 Star' AS review_rating, COUNT(review_id) AS num_reviews FROM yelp_reviews WHERE stars = 1
                 UNION
                 SELECT '2 Star' AS review_rating, COUNT(review_id) AS num_reviews FROM yelp_reviews WHERE stars = 2
                 UNION
                 SELECT '3 Star' AS review_rating, COUNT(review_id) AS num_reviews FROM yelp_reviews WHERE stars = 3
                 UNION
                 SELECT '4 Star' AS review_rating, COUNT(review_id) AS num_reviews FROM yelp_reviews WHERE stars = 4
                 UNION
                 SELECT '5 Star' AS review_rating, COUNT(review_id) AS num_reviews FROM yelp_reviews WHERE stars = 5
                 ORDER BY num_reviews DESC;
                 ''').fetch_pandas_all()

display(df)

  REVIEW_RATING  NUM_REVIEWS
0        5 Star      3231627
1        4 Star      1452918
2        1 Star      1069561
3        3 Star       691934
4        2 Star       544240

#### Volume of Each Rating by Business

In [78]:
# Count of reviews with each star value by business
df = cur.execute('''
                 SELECT 
                    business_id, 
                    SUM(CASE WHEN stars=1 THEN 1 ELSE 0 END) AS one_star_reviews,
                    SUM(CASE WHEN stars=2 THEN 1 ELSE 0 END) AS two_star_reviews,
                    SUM(CASE WHEN stars=3 THEN 1 ELSE 0 END) AS three_star_reviews,
                    SUM(CASE WHEN stars=4 THEN 1 ELSE 0 END) AS four_star_reviews,
                    SUM(CASE WHEN stars=5 THEN 1 ELSE 0 END) AS five_star_reviews,
                    COUNT(*) AS total_reviews,
                    SUM(stars) AS total_stars
                 FROM yelp_reviews
                 GROUP BY 1;
                 ''').fetch_pandas_all()

display(df)

,BUSINESS_ID,ONE_STAR_REVIEWS,TWO_STAR_REVIEWS,THREE_STAR_REVIEWS,FOUR_STAR_REVIEWS,FIVE_STAR_REVIEWS,TOTAL_REVIEWS,TOTAL_STARS
0,lCjNNCJKMEeAHjSUFqEH5A,0,0,0,3,6,9,42
1,nwN92Uje-xIKE5voPTTvBQ,18,28,36,102,425,609,2715
2,8OGLDw2Z0UK0aURh8eRVMQ,15,8,5,2,5,35,79
3,S8ZFYEgMejpChID8tzKo9A,79,115,236,658,1074,2162,9019
4,YRw-uBpdzRZngN6zzoC4WA,2,2,1,2,7,14,52
...,...,...,...,...,...,...,...,...
150341,I6p837glbhDog1XB4NSvKA,0,0,2,2,1,5,19
150342,5LIBxc9PNCGjtGk1I7HOpg,0,0,0,0,5,5,25
150343,615-GZzUg2Xpw-AkzOeXKA,3,0,0,0,2,5,13
150344,HEP7VxLY2v0mRDXPARrPyQ,1,0,0,0,4,5,21
150345,BVw_ABpa-K2mQvsQB5eIVg,0,0,0,0,6,6,30

In [85]:
# True star average for each business and percentage of five star and one star reviews to total reviews
df = cur.execute('''
                WITH cte AS (
                    SELECT 
                        business_id, 
                        SUM(CASE WHEN stars=1 THEN 1 ELSE 0 END) AS one_star_reviews,
                        SUM(CASE WHEN stars=2 THEN 1 ELSE 0 END) AS two_star_reviews,
                        SUM(CASE WHEN stars=3 THEN 1 ELSE 0 END) AS three_star_reviews,
                        SUM(CASE WHEN stars=4 THEN 1 ELSE 0 END) AS four_star_reviews,
                        SUM(CASE WHEN stars=5 THEN 1 ELSE 0 END) AS five_star_reviews,
                        COUNT(*) AS total_reviews,
                        SUM(stars) AS total_stars,
                        ROUND(AVG(stars), 2) AS true_avg_stars
                    FROM yelp_reviews
                    GROUP BY 1
                 )

                SELECT 
                    yb.name, yb.city, yb.state, total_reviews, total_stars,
                    true_avg_stars,
                    yb.stars AS rounded_avg_stars,
                    ROUND(five_star_reviews / total_reviews * 100, 2) AS five_star_pct,
                    ROUND(one_star_reviews / total_reviews * 100, 2) AS one_star_pct,
                FROM cte
                JOIN yelp_businesses yb
                    ON cte.business_id = yb.business_id
                LIMIT 20;
                ''').fetch_pandas_all()

display(df)

,NAME,CITY,STATE,TOTAL_REVIEWS,TOTAL_STARS,TRUE_AVG_STARS,ROUNDED_AVG_STARS,FIVE_STAR_PCT,ONE_STAR_PCT
0,The Gables Apartments,Greenwood,IN,12,16,1.33,1.5,0.00,83.33
1,Schiano's Pizza,Warminster,PA,29,83,2.86,3.0,31.03,41.38
2,Caliber Collision,Largo,FL,10,34,3.40,3.5,50.00,30.00
3,Gail Marcus,Philadelphia,PA,9,45,5.00,5.0,100.00,0.00
4,Employ Health,Nashville,TN,10,50,5.00,5.0,100.00,0.00
5,Value Vet,Nashville,TN,51,184,3.61,3.5,47.06,15.69
6,America's Mattress of Tucson,Tucson,AZ,7,35,5.00,5.0,100.00,0.00
7,Terry House Bed & Breakfast,New Castle,DE,5,22,4.40,4.5,40.00,0.00
8,Little Caesers Pizza,Souderton,PA,5,17,3.40,3.5,60.00,40.00
9,Piano Gastrolounge,Santa Barbara,CA,24,78,3.25,3.5,25.00,29.17
10,Moo Dang,Reno,NV,648,2763,4.26,4.0,58.80,4.17
11,Holiday Inn Express & Suites Oro Valley-Tucson...,Oro Valley,AZ,19,69,3.63,3.5,36.84,10.53
12,Dunkin',Blue Bell,PA,9,16,1.78,1.5,0.00,55.56
13,Panera Bread,Mt Juliet,TN,57,138,2.42,2.5,8.77,35.09
14,Grand Traverse Pie Co,Indianapolis,IN,5,19,3.80,4.0,0.00,0.00
15,Four Seasons Campground,Pilesgrove,NJ,17,57,3.35,3.5,47.06,17.65
16,"Randall Hedrick, DDS - St Petersburg Endodontics",Saint Petersburg,FL,5,25,5.00,5.0,100.00,0.00
17,Goodyear Auto Service,Tarpon Springs,FL,15,54,3.60,3.5,60.00,33.33
18,Pizza Hut,Saint Charles,MO,14,25,1.79,2.0,14.29,78.57
19,Tillys,Reno,NV,12,29,2.42,2.5,16.67,41.67

In [92]:
# Months with the highest total reviews and highest average star rating
df = cur.execute('''
                SELECT 
                    MONTH(review_date) AS month,
                    SUM(CASE WHEN stars=1 THEN 1 ELSE 0 END) AS one_star_reviews,
                    SUM(CASE WHEN stars=2 THEN 1 ELSE 0 END) AS two_star_reviews,
                    SUM(CASE WHEN stars=3 THEN 1 ELSE 0 END) AS three_star_reviews,
                    SUM(CASE WHEN stars=4 THEN 1 ELSE 0 END) AS four_star_reviews,
                    SUM(CASE WHEN stars=5 THEN 1 ELSE 0 END) AS five_star_reviews,
                    COUNT(*) AS total_reviews,
                    SUM(stars) AS total_stars,
                    ROUND(AVG(stars), 2) avg_stars
                FROM yelp_reviews
                GROUP BY 1
                ORDER BY COUNT(*) DESC;
                 ''').fetch_pandas_all()

display(df)

,MONTH,ONE_STAR_REVIEWS,TWO_STAR_REVIEWS,THREE_STAR_REVIEWS,FOUR_STAR_REVIEWS,FIVE_STAR_REVIEWS,TOTAL_REVIEWS,TOTAL_STARS,AVG_STARS
0,7,100135,51170,64669,135171,303482,654627,2454576,3.75
1,8,98608,49976,62289,129710,295801,636384,2383272,3.75
2,1,86852,46047,61474,131145,279014,604532,2283018,3.78
3,6,93282,46701,58791,123158,279805,601737,2254714,3.75
4,3,87976,46933,60527,127924,275195,598555,2251094,3.76
5,5,91994,46318,58076,120991,269196,586575,2188802,3.73
6,10,89243,44267,55856,115923,266520,571809,2141637,3.75
7,9,89705,44552,55136,114482,261499,565374,2109640,3.73
8,4,82676,43029,55083,116372,254311,551471,2071026,3.76
9,2,80051,42503,54620,116561,250390,544125,2047111,3.76
10,12,87611,42030,53080,111087,249765,543573,2024084,3.72
11,11,81428,40714,52333,110394,246649,531518,1994676,3.75

In [94]:
# Total reviews by each star amount and the average star review for each month in every year
df = cur.execute('''
                SELECT 
                    YEAR(review_date) AS year,
                    MONTH(review_date) AS month,
                    SUM(CASE WHEN stars=1 THEN 1 ELSE 0 END) AS one_star_reviews,
                    SUM(CASE WHEN stars=2 THEN 1 ELSE 0 END) AS two_star_reviews,
                    SUM(CASE WHEN stars=3 THEN 1 ELSE 0 END) AS three_star_reviews,
                    SUM(CASE WHEN stars=4 THEN 1 ELSE 0 END) AS four_star_reviews,
                    SUM(CASE WHEN stars=5 THEN 1 ELSE 0 END) AS five_star_reviews,
                    COUNT(*) AS total_reviews,
                    SUM(stars) AS total_stars,
                    ROUND(AVG(stars), 2) avg_stars
                FROM yelp_reviews
                GROUP BY 1, 2
                ORDER BY COUNT(*) DESC;
                 ''').fetch_pandas_all()

display(df)

,YEAR,MONTH,ONE_STAR_REVIEWS,TWO_STAR_REVIEWS,THREE_STAR_REVIEWS,FOUR_STAR_REVIEWS,FIVE_STAR_REVIEWS,TOTAL_REVIEWS,TOTAL_STARS,AVG_STARS
0,2018,7,14222,6593,7539,15695,44862,88911,337115,3.79
1,2019,3,14407,6175,7009,14038,42753,84382,317701,3.77
2,2019,7,14466,5993,6867,13405,42555,83286,313448,3.76
3,2019,6,14512,5880,6807,13046,42201,82446,309882,3.76
4,2019,8,13992,5707,6694,13060,42660,82113,311028,3.79
...,...,...,...,...,...,...,...,...,...,...
199,2005,8,2,1,11,22,30,66,275,4.17
200,2005,10,0,3,2,18,16,39,164,4.21
201,2005,6,2,2,4,15,15,38,153,4.03
202,2005,4,1,0,4,10,11,26,108,4.15
203,2005,2,0,0,0,2,1,3,13,4.33

In [7]:
# Average length of review for each star rating
df = cur.execute('''
                SELECT 
                    '1' AS num_stars,
                    ROUND(AVG(LENGTH(user_review)), 2) avg_review_length
                FROM yelp_reviews
                WHERE stars=1
                UNION
                SELECT 
                    '2' AS num_stars,
                    ROUND(AVG(LENGTH(user_review)), 2) avg_review_length
                FROM yelp_reviews
                WHERE stars=2
                UNION
                SELECT 
                    '3' AS num_stars,
                    ROUND(AVG(LENGTH(user_review)), 2) avg_review_length
                FROM yelp_reviews
                WHERE stars=3
                UNION
                SELECT 
                    '4' AS num_stars,
                    ROUND(AVG(LENGTH(user_review)), 2) avg_review_length
                FROM yelp_reviews
                WHERE stars=4
                UNION
                SELECT 
                    '5' AS num_stars,
                    ROUND(AVG(LENGTH(user_review)), 2) avg_review_length
                FROM yelp_reviews
                WHERE stars=5
                ORDER BY num_stars;
                 ''').fetch_pandas_all()

display(df)

  NUM_STARS AVG_REVIEW_LENGTH
0         1            713.78
1         2            721.08
2         3            669.20
3         4            587.50
4         5            463.02

In [12]:
# Number of businesses and avg star rating by city
df = cur.execute('''
                SELECT 
                    city,
                    COUNT(DISTINCT yb.business_id) num_businesses,
                    ROUND(AVG(yr.stars), 2) as avg_stars
                FROM yelp_reviews yr
                JOIN yelp_businesses yb
                    ON yr.business_id = yb.business_id
                GROUP BY city
                ORDER BY 2 DESC
                LIMIT 20;
                 ''').fetch_pandas_all()

display(df)

                CITY  NUM_BUSINESSES AVG_STARS
0       Philadelphia           14569      3.79
1             Tucson            9250      3.70
2              Tampa            9050      3.75
3       Indianapolis            7540      3.82
4          Nashville            6971      3.82
5        New Orleans            6209      3.94
6               Reno            5935      3.75
7           Edmonton            5054      3.57
8        Saint Louis            4827      3.81
9      Santa Barbara            3829      4.00
10             Boise            2937      3.79
11        Clearwater            2221      3.76
12  Saint Petersburg            1663      3.87
13          Metairie            1643      3.61
14            Sparks            1624      3.61
15        Wilmington            1446      3.53
16          Franklin            1414      3.66
17         St. Louis            1255      3.76
18    St. Petersburg            1185      3.88
19          Meridian            1043      3.64

In [13]:
# Number of businesses and avg star rating by state
df = cur.execute('''
                SELECT 
                    state,
                    COUNT(DISTINCT yb.business_id) num_businesses,
                    ROUND(AVG(yr.stars), 2) as avg_stars
                FROM yelp_reviews yr
                JOIN yelp_businesses yb
                    ON yr.business_id = yb.business_id
                GROUP BY state
                ORDER BY 2 DESC;
                 ''').fetch_pandas_all()

display(df)

   STATE  NUM_BUSINESSES AVG_STARS
0     PA           34039      3.70
1     FL           26330      3.76
2     TN           12056      3.76
3     IN           11247      3.79
4     MO           10913      3.73
5     LA            9924      3.88
6     AZ            9912      3.69
7     NJ            8536      3.56
8     NV            7715      3.73
9     AB            5573      3.57
10    CA            5203      3.96
11    ID            4467      3.76
12    DE            2265      3.51
13    IL            2145      3.51
14    TX               4      2.51
15    CO               3      3.97
16    MA               2      1.30
17    HI               2      4.15
18    WA               2      3.68
19    NC               1      1.83
20    SD               1      4.52
21    MI               1      2.45
22    VT               1      4.60
23    VI               1      2.73
24    MT               1      5.00
25   XMS               1      3.80
26    UT               1      4.68

In [18]:
# Reviews by quarter
df = cur.execute('''
                SELECT 
                    QUARTER(review_date) AS quarter,
                    SUM(CASE WHEN stars=1 THEN 1 ELSE 0 END) AS one_star_reviews,
                    SUM(CASE WHEN stars=2 THEN 1 ELSE 0 END) AS two_star_reviews,
                    SUM(CASE WHEN stars=3 THEN 1 ELSE 0 END) AS three_star_reviews,
                    SUM(CASE WHEN stars=4 THEN 1 ELSE 0 END) AS four_star_reviews,
                    SUM(CASE WHEN stars=5 THEN 1 ELSE 0 END) AS five_star_reviews,
                    COUNT(*) AS total_reviews,
                    SUM(stars) AS total_stars,
                    ROUND(AVG(stars), 2) avg_stars
                FROM yelp_reviews
                GROUP BY 1
                ORDER BY COUNT(*) DESC;
                 ''').fetch_pandas_all()

display(df)

,QUARTER,ONE_STAR_REVIEWS,TWO_STAR_REVIEWS,THREE_STAR_REVIEWS,FOUR_STAR_REVIEWS,FIVE_STAR_REVIEWS,TOTAL_REVIEWS,TOTAL_STARS,AVG_STARS
0,3,288448,145698,182094,379363,860782,1856385,6947488,3.74
1,1,254879,135483,176621,375630,804599,1747212,6581223,3.77
2,2,267952,136048,171950,360521,803312,1739783,6514542,3.74
3,4,258282,127011,161269,337404,762934,1646900,6160397,3.74

In [20]:
# Reviews by year and quarter
df = cur.execute('''
                SELECT 
                    YEAR(review_date) AS year,
                    QUARTER(review_date) AS quarter,
                    SUM(CASE WHEN stars=1 THEN 1 ELSE 0 END) AS one_star_reviews,
                    SUM(CASE WHEN stars=2 THEN 1 ELSE 0 END) AS two_star_reviews,
                    SUM(CASE WHEN stars=3 THEN 1 ELSE 0 END) AS three_star_reviews,
                    SUM(CASE WHEN stars=4 THEN 1 ELSE 0 END) AS four_star_reviews,
                    SUM(CASE WHEN stars=5 THEN 1 ELSE 0 END) AS five_star_reviews,
                    COUNT(*) AS total_reviews,
                    SUM(stars) AS total_stars,
                    ROUND(AVG(stars), 2) avg_stars
                FROM yelp_reviews
                GROUP BY 1, 2
                ORDER BY COUNT(*) DESC;
                 ''').fetch_pandas_all()

display(df)

,YEAR,QUARTER,ONE_STAR_REVIEWS,TWO_STAR_REVIEWS,THREE_STAR_REVIEWS,FOUR_STAR_REVIEWS,FIVE_STAR_REVIEWS,TOTAL_REVIEWS,TOTAL_STARS,AVG_STARS
0,2018,3,40139,17710,20067,40827,122165,240908,909893,3.78
1,2019,2,42056,17151,19709,38330,122789,240035,902750,3.76
2,2018,2,38346,17545,20530,42204,120221,238846,904947,3.79
3,2019,3,41380,16934,19627,38194,122197,238332,897890,3.77
4,2019,1,38377,16580,19077,38398,118192,230624,873320,3.79
...,...,...,...,...,...,...,...,...,...,...
64,2006,1,23,27,88,217,242,597,2419,4.05
65,2005,3,15,26,97,144,112,394,1494,3.79
66,2005,4,6,11,32,82,80,211,852,4.04
67,2005,2,4,9,24,67,68,172,702,4.08
68,2005,1,5,8,18,22,24,77,283,3.68

In [ ]:
# Most recent reviews for each business
df = cur.execute('''
                WITH cte AS (
                    SELECT 
                        business_id,
                        review_date,
                        user_review,
                        stars,
                        ROW_NUMBER() OVER(PARTITION BY business_id ORDER BY review_date DESC) AS rn
                    FROM yelp_reviews
                )
                SELECT 
                    yb.name,
                    yb.city,
                    yb.state,
                    yb.postal_code,
                    review_date,
                    cte.stars,
                    user_review
                FROM cte
                JOIN yelp_businesses yb
                    ON cte.business_id = yb.business_id
                WHERE rn=1;
                 ''').fetch_pandas_all()

display(df)

,NAME,CITY,STATE,POSTAL_CODE,REVIEW_DATE,STARS,USER_REVIEW
0,The Gables Apartments,Greenwood,IN,46143,2021-11-28,2,"If you think you might be denied, don't apply ..."
1,Schiano's Pizza,Warminster,PA,18974,2021-12-20,1,I love this place but tonight got rudely treat...
2,Caliber Collision,Largo,FL,33771,2022-01-15,1,At first caliber collision was on it! Sending ...
3,Gail Marcus,Philadelphia,PA,19102,2021-05-10,5,Gail was great to speak with. She allowed me t...
4,Employ Health,Nashville,TN,37203,2016-12-16,5,I was on vacation and needed a doctor at 9am o...
...,...,...,...,...,...,...,...
150341,MIZU Sushi Bar,Philadelphia,PA,19103,2017-11-02,2,How someone can screw up something as simple a...
150342,Beniki Nail Spa,Mount Juliet,TN,37122,2021-10-01,4,Do you know what heartbreak is? I'll tell you ...
150343,Arby's,Nashville,TN,37115,2019-12-25,5,Nothing more then a regular Arby's but clean a...
150344,Jet's Pizza,Madison,TN,37115,2020-01-30,1,I ordered two pizzas with extra cheese by web ...
150345,DSW Designer Shoe Warehouse,Ardmore,PA,19003,2014-04-05,4,This DSW has just moved to the Wynnewood shopp...

In [ ]:
# Most reviewed businesses
df = cur.execute('''
                SELECT yb.name, yb.city, yb.state, COUNT(yr.review_id) AS review_count, ROUND(AVG(yr.stars), 2) AS avg_stars
                FROM yelp_reviews yr
                JOIN yelp_businesses yb
                ON yr.business_id = yb.business_id
                GROUP BY yb.name, yb.city, yb.state
                ORDER BY COUNT(yr.review_id) DESC
                LIMIT 20;
                 ''').fetch_pandas_all()

display(df)

,NAME,CITY,STATE,REVIEW_COUNT,AVG_STARS
0,Acme Oyster House,New Orleans,LA,7673,4.12
1,Oceana Grill,New Orleans,LA,7516,4.15
2,Hattie Bâ€™s Hot Chicken - Nashville,Nashville,TN,6160,4.45
3,Reading Terminal Market,Philadelphia,PA,5778,4.61
4,Ruby Slipper Cafe,New Orleans,LA,5523,4.21
5,Ruby Slipper - New Orleans,New Orleans,LA,5264,4.29
6,Mother's Restaurant,New Orleans,LA,5254,3.44
7,Royal House,New Orleans,LA,5146,3.79
8,Commander's Palace,New Orleans,LA,4969,4.29
9,Los Agaves,Santa Barbara,CA,4718,4.44
10,Luke,New Orleans,LA,4661,4.18
11,Cochon,New Orleans,LA,4480,4.19
12,Felix's Restaurant & Oyster Bar,New Orleans,LA,4300,3.93
13,Pat's King of Steaks,Philadelphia,PA,4293,3.24
14,Biscuit Love: Gulch,Nashville,TN,4247,4.17
15,Pappy's Smokehouse,Saint Louis,MO,4093,4.47
16,Gumbo Shop,New Orleans,LA,3971,3.92
17,Cochon Butcher,New Orleans,LA,3917,4.51
18,Sabrina's CafÃ©,Philadelphia,PA,3815,4.14
19,Grand Sierra Resort and Casino,Reno,NV,3634,2.98

## Users

In [21]:
# Get distinct number of users
df = cur.execute('''
                SELECT COUNT(*) AS registered_users
                FROM yelp_users;
                 ''').fetch_pandas_all()

display(df)

   REGISTERED_USERS
0           1987897

In [ ]:
# Get number of users with at least 1 review
df = cur.execute('''
                SELECT COUNT(user_id) AS reviewers
                FROM yelp_users
                WHERE review_count >= 1;
                 ''').fetch_pandas_all()

display(df)

   REVIEWERS
0    1987843

In [34]:
# Get number of users with more reviews than average
df = cur.execute('''
                SELECT COUNT(user_id) as highly_active_users
                FROM yelp_users
                WHERE review_count >= (
                SELECT ROUND(AVG(review_count), 2) AS avg_reviews
                FROM yelp_users
                );
                 ''').fetch_pandas_all()

display(df)

   HIGHLY_ACTIVE_USERS
0               374650

In [ ]:
# Get number of users with at least one tip
df = cur.execute('''
                SELECT COUNT(user_id) AS tippers
                FROM yelp_tips;
                 ''').fetch_pandas_all()

display(df)

   TIPPERS
0   301758

In [ ]:
# Get number of users with more fans than average
df = cur.execute('''
                SELECT COUNT(user_id) as influential_users
                FROM yelp_users
                WHERE fans >= (
                SELECT ROUND(AVG(fans), 2) AS avg_fans
                FROM yelp_users
                );
                 ''').fetch_pandas_all()

display(df)

   INFLUENTIAL_USERS
0             210208

In [30]:
# Get number of users with at least one year of elite status
df = cur.execute('''
                SELECT COUNT(user_id) AS elite_users
                FROM yelp_users
                WHERE elite != '';
                 ''').fetch_pandas_all()

display(df)

   ELITE_USERS
0        91198

In [ ]:
# Get number of users with an account created in the the latest year of the database
df = cur.execute('''
                SELECT COUNT(user_id) AS fresh_accounts
                FROM yelp_users
                WHERE EXTRACT(year from yelping_since) = 2022;
                 ''').fetch_pandas_all()

display(df)

   YOUNG_ACCOUNTS
0            2782

In [22]:
# Create user engagement funnel
df = cur.execute('''
                SELECT 'Registered Users' AS User_Type, COUNT(*) AS Number_Of_Users, 100 AS Pct_Of_Users
                FROM yelp_users
                UNION
                SELECT 'Reviewers', COUNT(user_id), ROUND(COUNT(user_id) / (SELECT COUNT(*) FROM yelp_users) * 100, 3)
                FROM yelp_users
                WHERE review_count >= 1
                UNION
                SELECT 'Highly Active Reviewers', COUNT(user_id), ROUND(COUNT(user_id) / (SELECT COUNT(*) FROM yelp_users) * 100, 3)
                FROM yelp_users
                WHERE review_count >= (
                SELECT ROUND(AVG(review_count), 2) AS avg_reviews
                FROM yelp_users
                )
                UNION
                SELECT 'Tippers', COUNT(user_id), ROUND(COUNT(user_id) / (SELECT COUNT(*) FROM yelp_users) * 100, 3)
                FROM yelp_tips
                UNION
                SELECT 'Influential Users', COUNT(user_id), ROUND(COUNT(user_id) / (SELECT COUNT(*) FROM yelp_users) * 100, 3)
                FROM yelp_users
                WHERE fans >= (
                SELECT ROUND(AVG(fans), 2) AS avg_fans
                FROM yelp_users
                )
                UNION
                SELECT 'Elite Users', COUNT(user_id), ROUND(COUNT(user_id) / (SELECT COUNT(*) FROM yelp_users) * 100, 3)
                FROM yelp_users
                WHERE elite != ''
                UNION
                SELECT 'Fresh Accounts', COUNT(user_id), ROUND(COUNT(user_id) / (SELECT COUNT(*) FROM yelp_users) * 100, 3)
                FROM yelp_users
                WHERE EXTRACT(year from yelping_since) = 2022
                ORDER BY 2 DESC
                ;
                 ''').fetch_pandas_all()

display(df)

                 USER_TYPE  NUMBER_OF_USERS PCT_OF_USERS
0         Registered Users          1987897      100.000
1                Reviewers          1987843       99.997
2                  Tippers           908915       45.722
3  Highly Active Reviewers           374650       18.847
4        Influential Users           210208       10.574
5              Elite Users            91198        4.588
6           Fresh Accounts             2782        0.140